kernel/net/pci_net_card.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2021-01-20 Wed 20:35 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>PCI层与网卡</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">PCI层与网卡</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5d6158a">1. 关键数据结构</a></li>
<li><a href="#orgebacc9d">2. 注册一个PCI NIC设备驱动</a></li>
<li><a href="#orgf866b61">3. 电源管理与Wake-on-LAN</a></li>
<li><a href="#org75c8e9e">4. PCI NIC驱动的初始化</a></li>
</ul>
</div>
</div>
<p>
本文总体介绍下PCI，再结合网卡初始化的具体流程来详细理解PCI层的功能。
</p>

<p>
PCI层存在的意义是：
</p>
<ul class="org-ul">
<li>对于PCI设备提供一些通用的公共函数接口。</li>
<li>对于内核来说也更容易收集与维护PCI设备的信息，比如统计等。</li>
</ul>

<p>
下面介绍下PCI层的几个关键数据结构，后面会用网卡这个具体的例子来解释这些关键的数据结构是如何被初始化的。
</p>

<div id="outline-container-org5d6158a" class="outline-2">
<h2 id="org5d6158a"><span class="section-number-2">1</span> 关键数据结构</h2>
<div class="outline-text-2" id="text-1">
<p>
下面来看看几个在PCI层使用的关键数据结构。
</p>
<ul class="org-ul">
<li><p>
pci_device_id
</p>

<p>
根据PCI标准定义的设备标识符。
</p></li>

<li><p>
pci_dev
</p>

<p>
如同网卡设备有net_device结构体，每个PCI设备也有一个pci_dev结构体实例。
</p></li>

<li><p>
pci_driver
</p>

<p>
pci层与设备驱动的接口，这个结构体主要是由函数指针组成，所有的PCI设备都会使用它。这些函数指针由对应的设备驱动设置将它们指向恰当的函数实现。下面简单介绍下这个结构体中的一些主要的成员：
</p>
<ol class="org-ol">
<li><p>
name
</p>

<p>
驱动的名字。
</p></li>

<li><p>
const struct pci_device_id *id_table
</p>

<p>
指向一个设备ID表，这个表是这个驱动所关心的。
</p></li>

<li><p>
int  (*probe)(struct pci_dev *dev, const struct pci_device_id *id)
</p>

<p>
当设备id和id_table中的匹配并且对应的设备正在寻找驱动，就会由pci层调用。这个函数会使能硬件，分配net_device结构体（对于网络设备的初始化），并且初始化和注册新设备。在这个函数里，驱动也会分配其它的数据结构，比如ring buffer用来接收和传送数据。
</p></li>

<li><p>
void (*remove)(struct pci_dev *dev)
</p>

<p>
当驱动unregister或可插拔设备被移除时就会调用此函数，它是与probe函数相对的一个函数，会clean up任何数据结构和状态。它是在进程上下文环境调用的，因此可以睡眠。
</p>

<p>
网络设备通常使用这个函数来释放分配的I/O端口、I/O memory，unregister一个设备，释放net_device以及其它在probe函数分配的辅助结构体。
</p></li>

<li><p>
int  (*suspend)(struct pci_dev *dev, pm_message_t state)
</p>

<p>
int  (*resume)(struct pci_dev *dev)
</p>

<p>
suspend用来将设备置于低功耗状态，resume则是将设备从低功耗状态中唤醒，多用于电源管理中。
</p></li>

<li><p>
struct pci_dynids dynids
</p>

<p>
动态ID，后文介绍。
</p></li>
</ol></li>
</ul>
</div>
</div>


<div id="outline-container-orgebacc9d" class="outline-2">
<h2 id="orgebacc9d"><span class="section-number-2">2</span> 注册一个PCI NIC设备驱动</h2>
<div class="outline-text-2" id="text-2">
<p>
PCI设备通过几个组合在一起的参数来唯一确定，包括vendor等。这些参数在内核里由pci_device_id结构体确定。它的定义如下：
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">pci_device_id</span> {
    <span style="color: #7CB8BB;">__u32</span> <span style="color: #DFAF8F;">vendor</span>, <span style="color: #DFAF8F;">device</span>;       <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">Vendor and device ID or PCI_ANY_ID</span><span style="color: #5F7F5F;">*/</span>
    <span style="color: #7CB8BB;">__u32</span> <span style="color: #DFAF8F;">subvendor</span>, <span style="color: #DFAF8F;">subdevice</span>; <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">Subsystem ID's or PCI_ANY_ID</span><span style="color: #5F7F5F;"> */</span>
    <span style="color: #7CB8BB;">__u32</span> <span style="color: #F0DFAF; font-weight: bold;">class</span>, class_mask;    <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">(class,subclass,prog-if) triplet</span><span style="color: #5F7F5F;"> */</span>
    <span style="color: #7CB8BB;">kernel_ulong_t</span> <span style="color: #DFAF8F;">driver_data</span>; <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">Data private to the driver</span><span style="color: #5F7F5F;"> */</span>
}&#65307;
</pre>
</div>

<p>
通常vendor和device用来标识设备已经足够了. subvendor和subdevice很少使用, 一般被设置成
PCI_ANY_ID. class和class_mask指明了设备所属的类别, 网卡设备一般是NETWORK类. driver_data是由驱动程序使用的私有数据. 
</p>

<p>
一般来说, 设备驱动程序都会向内核注册一个pci_device_id向量表, 里面存放都是这个设备所能处理的pci id.
</p>

<p>
pci设备驱动的注册和取消注册通过函数pci_register_driver和pci_unregister_driver. 通过pci_driver中的id_table, 内核就知道驱动能够管理哪些设备. 并且由于pci_driver中的函数指针, 内核就可以和设备进行交互, 给内核提供了一层统一的接口.
</p>

<p>
/sys文件系统会导出系统总线的信息, 这些信息包括各种各样的设备以及它们之间的关系. 除了使用pci_driver中由驱动注册的ID(id_table), 对于一个给定的设备, 系统管理员也可以配置新的ID给一个设备.
</p>

<p>
关于probing这里有两种方式:
</p>
<ol class="org-ol">
<li><p>
static
</p>

<p>
给出一个pci id, 内核可以查找到正确的pci驱动.
</p></li>
<li><p>
dynamic
</p>

<p>
通过用户配置的ID来查询, 实践中是很少使用的, 仅作为调试的目的. 动态的意思是系统管理员可以添加ID, 而不是说在运行过程中ID会改变.
</p></li>
</ol>

<p>
注意动态的方式要在内核编译为支持可热插拔时才有效.
</p>
</div>
</div>

<div id="outline-container-orgf866b61" class="outline-2">
<h2 id="orgf866b61"><span class="section-number-2">3</span> 电源管理与Wake-on-LAN</h2>
<div class="outline-text-2" id="text-3">
<p>
电源管理事件是由pci_driver的suspend和resume函数处理. 除了处理pci的状态, 这些函数也需要做如下的一些事情:
</p>
<ol class="org-ol">
<li>suspend函数会停止设备上egress队列的数据传送.</li>
<li>resume函数会重新使能设备上的egress队列, 使得数据能重新传送.</li>
</ol>

<p>
Wake-on-LAN(WOL)功能允许NIC在收到一种特殊类型的帧时可以唤醒处于待机模式的系统, 更多的细节后面会介绍.
</p>
</div>
</div>



<div id="outline-container-org75c8e9e" class="outline-2">
<h2 id="org75c8e9e"><span class="section-number-2">4</span> PCI NIC驱动的初始化</h2>
<div class="outline-text-2" id="text-4">
<p>
现在来看一个具体的例子: e100网卡驱动的注册. 其代码位于:./drivers/net/ethernet/intel/e100.c.
</p>

<p>
首先是pci id表:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #94BFF3;">#define</span> <span style="color: #93E0E3;">INTEL_8255X_ETHERNET_DEVICE</span>(<span style="color: #DFAF8F;">device_id</span>, <span style="color: #DFAF8F;">ich</span>) {\
    PCI_VENDOR_ID_INTEL, device_id, PCI_ANY_ID, PCI_ANY_ID, \
    PCI_CLASS_NETWORK_ETHERNET &lt;&lt; 8, 0xFFFF00, ich }
<span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">pci_device_id</span> <span style="color: #DFAF8F;">e100_id_table</span>[] = {
    INTEL_8255X_ETHERNET_DEVICE(0x1029, 0),
    INTEL_8255X_ETHERNET_DEVICE(0x1030, 0),
  ...
}
</pre>
</div>

<p>
从前文描述知道, PCI NIC驱动向内核注册一个pci_device_id类型的向量表来表明其能管理的设备. 如这里所示, e100驱动能管理的设备就是e100_id_table中所列的设备, 这里有几点需要注意:
</p>

<ol class="org-ol">
<li>第一个域被初始化为了固定的PCI_VENDOR_ID_INTEL. 哪个厂商具有什么ID可以从linux/include/linux/pci_ids.h文件中得知.</li>
<li>第三以及四个域(subvendor和subdevice)赋值为PCI_ANY_ID, 因为前两个域通常已经够用了.</li>
</ol>

<p>
该模块(驱动)的初始化函数为e100_init_module, 它会调用PCI层的pci_register_driver来向内核注册pci驱动. 
</p>

<p>
e100的几段关于PCI接口的关键代码如下:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">int</span> <span style="color: #93E0E3;">e100_probe</span>(<span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">pci_dev</span> *<span style="color: #DFAF8F;">pdev</span>, <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">pci_device_id</span> *<span style="color: #DFAF8F;">ent</span>)
{
...
}

<span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">e100_remove</span>(<span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">pci_dev</span> *<span style="color: #DFAF8F;">pdev</span>)
{
...
}

<span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">int</span> <span style="color: #93E0E3;">__maybe_unused</span> e100_suspend(<span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">device</span> *<span style="color: #DFAF8F;">dev_d</span>)
{
...
}

<span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">int</span> <span style="color: #93E0E3;">__maybe_unused</span> e100_resume(<span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">device</span> *<span style="color: #DFAF8F;">dev_d</span>)
{
...
}

<span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">pci_driver</span> <span style="color: #DFAF8F;">e100_driver</span> = {
    .name =         DRV_NAME,
    .id_table =     e100_id_table,
    .probe =        e100_probe,
    .remove =       e100_remove,

    <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">Power Management hooks</span><span style="color: #5F7F5F;"> */</span>
    .driver.pm =    &amp;e100_pm_ops,

    .shutdown =     e100_shutdown,
    .err_handler = &amp;e100_err_handler,
};

<span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">int</span> <span style="color: #93E0E3;">__init</span> e100_init_module(<span style="color: #7CB8BB;">void</span>)
{
...
    <span style="color: #F0DFAF; font-weight: bold;">return</span> pci_register_driver(&amp;e100_driver);
}

<span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">__exit</span> e100_cleanup_module(<span style="color: #7CB8BB;">void</span>)
{
    pci_unregister_driver(&amp;e100_driver);
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(pqy7172@gmail.com)</p>
<p class="date">Created: 2021-01-20 Wed 20:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
